wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_USART - 20170319.C
/******************************** User_library *********************************
* 文件名 	: STM32_SDCard.H
* 作者   	: wegam@sina.com
* 版本   	: V
* 日期   	: 2016/01/01
* 说明   	: 
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/


#include "STM32_USART.H"

#include "STM32_GPIO.H"
//#include	"stdio.h"			//用于printf
//#include	"string.h"			//用于printf
//#include	"stdarg.h"			//用于获取不确定个数的参数
//#include	"stdlib.h"		//malloc动态申请内存空间
/*##############################################################################
################################################################################
设置波特率时的误差计算
--------------------------------------------------------------------------------
波特率				|fPCLK = 36MHz	误差%			|		fPCLK = 72MHz	误差%			|
--------------------------------------------------------------------------------
2400				|						0%						|						0%							
--------------------------------------------------------------------------------
9600				|						0%						|						0%								
--------------------------------------------------------------------------------
19200				|						0%						|						0%							
--------------------------------------------------------------------------------
57600				|						0%						|						0%							
--------------------------------------------------------------------------------
115200			|						0.15%					|						0%							
--------------------------------------------------------------------------------
230400			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
460800			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
921600			|						0.16%					|						0.16%							
--------------------------------------------------------------------------------
2250000			|						0%						|						0%							
--------------------------------------------------------------------------------

################################################################################
###############################################################################*/
//u8 Usart_Buffer[32]={0};
//选择串口开启
char *USART_BUFFER;
u32	USART_BUFFERSIZE;
/*****************************USART DMA方式收发送配置过程*******************************/
//****1.RCC（复位和时钟控制寄存器）初始化，启用GPIO、DMA、USART时钟。********************/ 
//****2.NVIC（嵌套向量中断控制寄存器）初始化，完成各个硬件中断的配置。********************/
//****3.USART初始化，配置串口，设置DMA通道等。********************/ 
//****4.DMA初始化，完成DMA的配置。********************/

//#define USE_USART USARTSELECT_TypeDef*;
/*****************************USART DMA方式收发送配置过程*******************************/
/*******************************************************************************
*函数名		: USART_Configuration
*功能描述	:	串口配置
*输入			:	串口号	--------USARTx：USART1/USART2/USART3/UART4/UART5
						波特率	--------USART_BaudRate
						字长----------USART_WordLength
						停止位	--------USART_StopBits
						奇偶校验------USART_Parity
						串口DMA使能---UsartDMAState NewState
*输出			:	无
*返回值		:	无
*例程			:	USART_Configuration(USART1,19200,8,1,0);
*******************************************************************************/
void USART_BASIC_Configuration(USART_TypeDef* USARTx,u32 USART_BaudRate,u8 NVICPreemptionPriority,u8 NVIC_SubPriority)	//串口配置
{

	//1)**********定义变量
//	USART_InitTypeDef USART_InitStructure;				//USART结构体	
//	GPIO_InitTypeDef GPIO_InitStructure;					//GPIO结构体
//	NVIC_InitTypeDef NVIC_InitStructure; 					//NVIC结构体

//	
//	u16 TXD_Pin=0;																//串口发送脚
//	u16 RXD_Pin=0;																//串口接收脚
//	GPIO_TypeDef* GPIO_TX=0;
//	GPIO_TypeDef* GPIO_RX=0;
//	u8 USARTx_IRQChannel=0;
	
	
	//2)**********串口基础配置
	USART_Set(USARTx,USART_BaudRate,NVICPreemptionPriority,NVIC_SubPriority);				//根据串口号设置相关引脚和返回中断信号源
	
//	USART_Cmd(USARTx, ENABLE);
	//4)**********串口接收中断开
	//--若DMA接收未开启，则使用串口接收中断
	//--若DMA接收开启，串口接收中断应该关闭，在DMA配置中会将串口接收中断关闭
//	USART_ITConfig(USARTx,USART_IT_RXNE, ENABLE);		//接收中断--开
	USART_ITConfig(USART2,USART_IT_IDLE,ENABLE);		//接收中断--开
//	USART_ITConfig(USARTx, USART_IT_IDLE, ENABLE);     //接收空闲中断使能
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 	//清除空闲串口标志位
//	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 	//清除空闲串口标志位
	/* 开启DMA方式接收*/
	USART_DMACmd(USARTx,USART_DMAReq_Rx,ENABLE);
	/* 开启DMA方式发送*/
	USART_DMACmd(USARTx,USART_DMAReq_Tx,ENABLE);
	//5)**********使能串口
	USART_Cmd(USARTx, ENABLE);
}
/*******************************************************************************
*函数名		:	USART_DMA_Configuration
*功能描述	:	DMA串口配置，需要将串口接收中断关闭，然后开启串口空闲中断，利用DMA自动接收串口数据
*输入			:	RXDBuffer--接收缓冲区，可以与发送缓冲区共用,
						TXDBuffer--发送缓冲区，可以与接收缓冲区共用,
						BufferSize--缓存大小
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
void USART_DMA_Configuration(USART_TypeDef* USARTx,u32 USART_BaudRate,u8 NVICPreemptionPriority,u8 NVIC_SubPriority,u32 *RXDBuffer,u32 *TXDBuffer,u32 BufferSize)	//USART_DMA配置
{
	//1)**********定义变量	
	DMA_InitTypeDef DMA_Initstructure;
	NVIC_InitTypeDef NVIC_Initstructure;
	
	DMA_Channel_TypeDef* DMAx_Channeltx=0;			//DMA发送通道请求信号---当DMA串口发送数据完成时，会发起DMA中断
	DMA_Channel_TypeDef* DMAx_Channelrx=0;			//DMA接收通道请求信号---DMA串口接收由串口发起中断，因此此处接收通道中断不使用
	u8 DMAx_Channelx_IRQChannel=0;							//DMA中断源
	u32 DMAx_FLAG_GLtx=0;												//DMA串口发送中断全局变量			
	u32 DMAx_FLAG_GLrx=0;												//DMA串口接收中断全局变量
	
	USART_BUFFERSIZE=BufferSize;
	
//	//2)**********关闭串口等待DMA配置完成	
//	USART_Cmd(USARTx, DISABLE);
	
//	//3)**********关闭串口等待DMA配置完成
//	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);	
	//2)**********串口基础配置
	USART_Set(USARTx,USART_BaudRate,NVICPreemptionPriority,NVIC_SubPriority);				//根据串口号设置相关引脚和返回中断信号源
	//4)**********根据串口索引相关DMA通道及其它参数
	if(USARTx==USART1)
	{
		DMAx_Channeltx=DMA1_Channel4;
		DMAx_Channelrx=DMA1_Channel5;
		DMAx_Channelx_IRQChannel=DMA1_Channel4_IRQChannel;
		DMAx_FLAG_GLtx=DMA1_FLAG_GL4;
		DMAx_FLAG_GLrx=DMA1_FLAG_GL5;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);	
	}
	else if(USARTx==USART2)
	{
		DMAx_Channeltx=DMA1_Channel7;
		DMAx_Channelrx=DMA1_Channel6;
		DMAx_Channelx_IRQChannel=DMA1_Channel7_IRQChannel;
		DMAx_FLAG_GLtx=DMA1_FLAG_GL7;
		DMAx_FLAG_GLrx=DMA1_FLAG_GL6;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);	
	}
	else if(USARTx==USART3)
	{
		DMAx_Channeltx=DMA1_Channel2;
		DMAx_Channelrx=DMA1_Channel3;
		DMAx_Channelx_IRQChannel=DMA1_Channel2_IRQChannel;
		DMAx_FLAG_GLtx=DMA1_FLAG_GL2;
		DMAx_FLAG_GLrx=DMA1_FLAG_GL3;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1,ENABLE);	
	}
	else if(USARTx==UART4)
	{
		DMAx_Channeltx=DMA2_Channel5;
		DMAx_Channelrx=DMA2_Channel3;
		DMAx_Channelx_IRQChannel=DMA2_Channel3_IRQChannel;
		DMAx_FLAG_GLtx=DMA2_FLAG_GL5;
		DMAx_FLAG_GLrx=DMA2_FLAG_GL3;
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2,ENABLE);	
	}
	else if(USARTx==UART5)
	{
	}
	//5)**********DMA发送初始化，外设作为DMA的目的端
	DMA_Initstructure.DMA_PeripheralBaseAddr =  (u32)(&USARTx->DR);					//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr     = (u32)TXDBuffer;							//DMA数据内存地址
	DMA_Initstructure.DMA_DIR = DMA_DIR_PeripheralDST;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize = USART_BUFFERSIZE; 													//指定DMA通道的DMA缓存的大小
//	DMA_Initstructure.DMA_BufferSize = sizeof(MemoryAddr[0]); 						//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMAx_Channeltx,&DMA_Initstructure);														//初始化DMA

	//6)**********DMA接收初始化，外设作为DMA的源端
	DMA_Initstructure.DMA_PeripheralBaseAddr =  (u32)(&USARTx->DR);					//DMA外设源地址
	DMA_Initstructure.DMA_MemoryBaseAddr     = 	(u32)RXDBuffer;						//DMA数据内存地址
	DMA_Initstructure.DMA_DIR = DMA_DIR_PeripheralSRC;											//DMA_DIR_PeripheralDST（外设作为DMA的目的端），DMA_DIR_PeripheralSRC（外设作为数据传输的来源）
	DMA_Initstructure.DMA_BufferSize = USART_BUFFERSIZE; 													//指定DMA通道的DMA缓存的大小
//	DMA_Initstructure.DMA_BufferSize = sizeof(MemoryAddr); 								//指定DMA通道的DMA缓存的大小
	DMA_Initstructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;				//DMA_PeripheralInc_Enable（外设地址寄存器递增），DMA_PeripheralInc_Disable（外设地址寄存器不变），
	DMA_Initstructure.DMA_MemoryInc =DMA_MemoryInc_Enable;									//DMA_MemoryInc_Enable（内存地址寄存器递增），DMA_MemoryInc_Disable（内存地址寄存器不变）
	DMA_Initstructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;	//外设数据宽度--DMA_PeripheralDataSize_Byte（数据宽度为8位），DMA_PeripheralDataSize_HalfWord（数据宽度为16位），DMA_PeripheralDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;					//内存数据宽度--DMA_MemoryDataSize_Byte（数据宽度为8位），DMA_MemoryDataSize_HalfWord（数据宽度为16位），DMA_MemoryDataSize_Word（数据宽度为32位）
	DMA_Initstructure.DMA_Mode = DMA_Mode_Normal;														//DMA工作模式--DMA_Mode_Normal（只传送一次）, DMA_Mode_Circular（不停地传送）
	DMA_Initstructure.DMA_Priority = DMA_Priority_High; 										//DMA通道的转输优先级--DMA_Priority_VeryHigh（非常高）DMA_Priority_High（高)，DMA_Priority_Medium（中），DMA_Priority_Low（低）
	DMA_Initstructure.DMA_M2M = DMA_M2M_Disable;														//DMA通道的内存到内存传输--DMA_M2M_Enable(设置为内存到内存传输)，DMA_M2M_Disable（非内存到内存传输）
	DMA_Init(DMAx_Channelrx,&DMA_Initstructure);														//初始化DMA
	
	//7)**********DMA通道中断初始化---此为DMA发送中断----DMA发送完成中断
	NVIC_Initstructure.NVIC_IRQChannel = DMAx_Channelx_IRQChannel;       		//通道设置为串口1中断
	NVIC_Initstructure.NVIC_IRQChannelPreemptionPriority=NVICPreemptionPriority;
	NVIC_Initstructure.NVIC_IRQChannelSubPriority = NVIC_SubPriority; 			//中断响应优先级0	
	NVIC_Initstructure.NVIC_IRQChannelCmd = ENABLE;        									//打开中断
	NVIC_Init(&NVIC_Initstructure);
	
	
