wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_USART - 20170319.C
	//8)**********配置相关中断
	//8.1)**********串口接收中断配置
	//--将串口接收中断关闭，然后开启串口空闲中断，利用DMA自动接收串口数据
	//--若DMA接收未开启，则使用串口接收中断
	//--若DMA接收开启，串口接收中断应该关闭，在DMA配置中会将串口接收中断关闭
//	USART_ITConfig(USARTx,USART_IT_RXNE, DISABLE);				//接收中断--关：因为DMA自动接收，
	USART_ITConfig(USARTx,USART_IT_IDLE, ENABLE);					//使用空闲中断，DMA自动接收，检测到总线空闲表示发送端已经发送完成，数据保存在DMA缓冲器中
	USART_ClearITPendingBit(USARTx,USART_IT_IDLE); 				//清除空闲串口标志位

	//8.2)**********使能串口DMA方式接收
	USART_DMACmd(USARTx,USART_DMAReq_Rx,ENABLE);
	//8.3)**********使能串口DMA方式发送
	USART_DMACmd(USARTx,USART_DMAReq_Tx,ENABLE);
	//9)**********清除相关中断标志位	
	//	DMA_Cmd(DMAx_Channeltx,ENABLE);
	//9.2)**********使能相关DMA通道传输完成中断
	DMA_ITConfig(DMAx_Channeltx,DMA_IT_TC, ENABLE);
	//9.3)**********清除串口DMA方式发送中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLtx);                                 					// 清除DMA所有标志
	//9.3)**********清除串口DMA方式接收中断全局标志
	DMA_ClearFlag(DMAx_FLAG_GLrx);                                 					// 清除DMA所有标志	
	//10.1)**********启动串口DMA方式接收
	/* 启动DMA1通道5*/
	DMA_Cmd(DMAx_Channelrx,ENABLE);	
	//9.1)**********关闭DMA发送
	DMA_Cmd(DMAx_Channeltx,ENABLE);
	//10.2)**********使能串口
	USART_Cmd(USARTx, ENABLE);
	

}
/*******************************************************************************
*函数名		: function
*功能描述	:	串口接收服务函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
int USART_DMAPrintf(USART_TypeDef* USARTx,const char *format,...)		//后边的省略号就是可变参数
{
	
//		va_list ap; 										//VA_LIST 是在C语言中解决变参问题的一组宏，所在头文件：#include <stdarg.h>,用于获取不确定个数的参数
//    static char string[ 256 ];			//定义数组，
//    va_start( ap, format );
//    vsprintf( string , format, ap );    
//    va_end( ap );

	//1)**********获取数据宽度
	u16 num=strlen((const char*)format);		//获取数据宽度
	//2)**********定义缓冲区大小变量
	unsigned int BufferSize;
	//3)**********args为定义的一个指向可变参数的变量，va_list以及下边要用到的va_start,va_end都是是在定义，可变参数函数中必须要用到宏， 在stdarg.h头文件中定义
	va_list args;                                        
	//4)**********申请动态空间
	USART_BUFFER = (char*)malloc(sizeof(char) * num);	
	//5)**********初始化args的函数，使其指向可变参数的第一个参数，format是可变参数的前一个参数
	va_start(args, format);
	//6)**********正常情况下返回生成字串的长度(除去\0),错误情况返回负值
	BufferSize = vsprintf(USART_BUFFER, format, args);
	//7)**********结束可变参数的获取
	va_end(args);                                      		
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(USARTx==USART1)
	{
		DMA1_Channel4->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel4->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel4,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==USART2)
	{
		DMA1_Channel7->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel7->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==USART3)
	{
		DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel2->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel2,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==UART4)
	{
		DMA1_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel5->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel5,ENABLE);											//DMA发送开启3
	}
//	else if(USARTx==UART5)
//	{
//		DMA1_Channel7->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel7->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
//		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启3
//	}
	
	return BufferSize;

}
/*******************************************************************************
*函数名		: function
*功能描述	:	串口接收服务函数
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:	USART_DMASend(USART2,"中文ENG=%d\n",num);
*特别说明	:	在DMA发送完成后需要释放动态空间，free(USART_BUFFER);
					:	USART_BUFFER定义在STM32_USART.H
*******************************************************************************/
int USART_DMASend(USART_TypeDef* USARTx,u32 *USART_BUFFER,u16 BufferSize)		//
{
                                  		
	//8)**********将等发送缓冲区大小（数据个数）及缓冲区地址发给DMA开启发送
	//8)**********DMA发送完成后注意应该释放缓冲区：free(USART_BUFFER);
	if(USARTx==USART1)
	{
		DMA1_Channel4->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel4->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel4,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==USART2)
	{
		DMA1_Channel7->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel7->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==USART3)
	{
		DMA1_Channel2->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel2->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel2,ENABLE);											//DMA发送开启3
	}
	else if(USARTx==UART4)
	{
		DMA1_Channel5->CNDTR =BufferSize;										//设定待发送缓冲区大小
		DMA1_Channel5->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
		DMA_Cmd(DMA1_Channel5,ENABLE);											//DMA发送开启3
	}
//	else if(USARTx==UART5)
//	{
//		DMA1_Channel7->CNDTR =BufferSize;										//设定待发送缓冲区大小
//		DMA1_Channel7->CMAR =(u32)USART_BUFFER;							//发送缓冲区	
//		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启3
//	}
	
	return BufferSize;

}
/*******************************************************************************
*函数名		:	USART_RX_DMAFlagClear
*功能描述	:	清除串口DMA接收中断标志
						->USART_IT_IDLE:当检测到总线空闲时，该位被硬件置位。如果USART_CR1中的IDLEIE为’1’，则产生中断。由软件序列清除该位(先读USART_SR，然后读USART_DR)。
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
u32 USART_RX_FlagClear(USART_TypeDef* USARTx)				//清除串口接收中断标志
{
//	ErrorStatus status = ERROR;
	u32 num=0;

	if(USARTx==USART1)
	{
		if(USART_GetITStatus(USART1,USART_IT_IDLE))
		{
			USART_ClearITPendingBit(USART1,USART_IT_IDLE); 									//清除空闲串口标志位
			DMA_Cmd(DMA1_Channel5,DISABLE);    														//关闭接收DMA
			num = USART1->DR; 																							//读出数据以完成清除标志			
			num = USART_BUFFERSIZE -  DMA_GetCurrDataCounter(DMA1_Channel5);	//得到真正接收数据个数
//			DMA1_Channel5->CNDTR=10;       										//重新设置接收数据个数	
			DMA1_Channel5->CNDTR=USART_BUFFERSIZE;	//得到真正接收数据个数			
			DMA_Cmd(DMA1_Channel5,ENABLE);  																//开启接收DMA			
			return num;
		}
	}
	else if(USARTx==USART2)
	{
		if(USART_GetITStatus(USART2,USART_IT_IDLE))
		{
			USART_ClearITPendingBit(USART2,USART_IT_IDLE); 									//清除空闲串口标志位
			DMA_ClearFlag(DMA1_FLAG_TC6);
			DMA_Cmd(DMA1_Channel6,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			return num;
		}
	}
	else if(USARTx==USART3)
	{
		if(USART_GetITStatus(USART3,USART_IT_IDLE))
		{
			USART_ClearITPendingBit(USART3,USART_IT_IDLE); 									//清除空闲串口标志位
			DMA_ClearFlag(DMA1_FLAG_TC3);
			DMA_Cmd(DMA1_Channel3,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			return num;
		}
	}
	else if(USARTx==UART4)
	{
		if(USART_GetITStatus(UART4,USART_IT_IDLE))
		{
			USART_ClearITPendingBit(UART4,USART_IT_IDLE); 									//清除空闲串口标志位
			DMA_ClearFlag(DMA2_FLAG_TC3);
			DMA_Cmd(DMA2_Channel3,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			return num;
		}
	}
	else if(USARTx==UART5)
	{
//		if(DMA_GetFlagStatus(DMA1_FLAG_TC4))
//		{
//			DMA_ClearFlag(DMA1_FLAG_TC4);
//			DMA_Cmd(DMA1_Channel4,DISABLE);			//DMA发送关闭
//		//			free(USART_BUFFER);									//释放动态空间
			return num;
	}
	else
	{
		return 0;
	}
	
	return num;
//	if(status==SUCCESS)
//	{
//		free(USART_BUFFER);						//释放动态空间
//	}	
//	return status;			//返回状态值
}
/*******************************************************************************
*函数名		:	USART_TX_DMAFlagClear
*功能描述	:	清除串口DMA发送全局中断标志
						->当传输完成DMA控制器指定的数据量时，DMA控制器在该DMA通道的中断向量上产生一中断。
						->在发送模式下，当DMA传输完所有要发送的数据时，DMA控制器设置DMA_ISR寄存器的TCIF标志；
						->监视USART_SR寄存器的TC标志可以确认USART通信是否结束，这样可以在关闭USART或进入停机模式之前避免破坏最后一次传输的数据；
						->软件需要先等待TXE=1，再等待TC=1。
*输入			: 
*输出			:	无
*返回值		:	无
*例程			:
*******************************************************************************/
ErrorStatus USART_TX_DMAFlagClear(USART_TypeDef* USARTx)				//清除串口DMA发送全局中断标志
{
	ErrorStatus status = ERROR;
//	status = SUCCESS;
//	if(DMA_GetFlagStatus(DMA1_FLAG_GL4))
//	{
//		DMA_ClearFlag(DMA1_FLAG_GL4);
//		DMA_Cmd(DMA1_Channel4,DISABLE);			//DMA发送关闭
//		free(USART_BUFFER);						//释放动态空间
//	}
	//4)**********根据串口索引相关DMA通道及其它参数
//	u8 DMAx_Channelx_IRQChannel=0;							//DMA中断源
//	u32 DMAx_FLAG_GLtx=0;												//DMA串口发送中断全局变量			
//	u32 DMAx_FLAG_GLrx=0;												//DMA串口接收中断全局变量
	if(USARTx==USART1)
	{
		if(DMA_GetFlagStatus(DMA1_FLAG_TC4))
		{
			DMA_ClearFlag(DMA1_FLAG_TC4);
			DMA_Cmd(DMA1_Channel4,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(USARTx==USART2)
	{
		if(DMA_GetFlagStatus(DMA1_FLAG_TC7))
		{
			DMA_ClearFlag(DMA1_FLAG_TC7);
			DMA_Cmd(DMA1_Channel7,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(USARTx==USART3)
	{
		if(DMA_GetFlagStatus(DMA1_FLAG_TC2))
		{
			DMA_ClearFlag(DMA1_FLAG_TC2);
			DMA_Cmd(DMA1_Channel2,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(USARTx==UART4)
	{
		if(DMA_GetFlagStatus(DMA2_FLAG_TC5))
		{
			DMA_ClearFlag(DMA2_FLAG_TC5);
			DMA_Cmd(DMA2_Channel5,DISABLE);			//DMA发送关闭
		//			free(USART_BUFFER);									//释放动态空间
			status = SUCCESS;
		}
		else
		{
			status = ERROR;
		}
	}
	else if(USARTx==UART5)
	{
//		if(DMA_GetFlagStatus(DMA1_FLAG_TC4))
//		{
//			DMA_ClearFlag(DMA1_FLAG_TC4);
//			DMA_Cmd(DMA1_Channel4,DISABLE);			//DMA发送关闭
//		//			free(USART_BUFFER);									//释放动态空间
//			status = SUCCESS;
//		}
//		else
//		{
			status = ERROR;
//		}
	}
	if(status==SUCCESS)
	{
		free(USART_BUFFER);						//释放动态空间
	}	
	return status;			//返回状态值

