wegam/STM32F10xUSBF/FWLIB/Lib/WOWLIB/SCR/STM32_USART - 20170319.C
}

/*******************************************************************************
* 函数名		:	
* 功能描述	:	printf重定义 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
int fputc(int ch, FILE *f)				//printf重定义
{

	USART_SendData(USART2, (unsigned char) ch);// USART1 可以换成 USART2 等

	while(!(USART_GetFlagStatus(USART2, USART_FLAG_TXE) == SET));

	return (ch);

}

  
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
//int fgetc(FILE *f)
//{
// 
//	while(!(USART_GetFlagStatus(USART1, USART_FLAG_RXNE) == SET))
//	{
//	}
//	return (USART_ReceiveData(USART1));
//}

/*******************************************************************************
*函数名		:USART_RX_Server
*功能描述	:串口接收服务函数
*输入			: 
*输出			:无
*返回值		:无
*例程			：
*******************************************************************************/

void USART_RX_Server(void)		//串口接收服务程序	
{
//	u16 num=0;
	WOW_Server(); 
//	USART_ClearITPendingBit(USART1,USART_IT_IDLE); 				//清除空闲串口标志位
//	USART_ClearITPendingBit(USART1,USART_IT_TC); 					//传输完成中断
//	USART_ClearITPendingBit(USART1,USART_IT_RXNE); 				//清除空闲串口标志位
	
//    if(USART_GetITStatus(USART1,USART_IT_IDLE) == SET)
//    {
////#ifdef	USART1_DMA
////		u16 num=0;
//		USART_ClearITPendingBit(USART1,USART_IT_IDLE); 				//清除空闲串口标志位
////		USART_ClearITPendingBit(USART1,USART_IT_RXNE); 				//清除空闲串口标志位
//		num = USART1->DR; 																		//读出数据以完成清除标志
//		DMA_Cmd(DMA1_Channel5,DISABLE);    										//关闭接收DMA
//		num = DMA1_BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel5);  	//得到真正接收数据个数
//		DMA1_Channel4->CNDTR =num;														//设定待发送数据个数
////		temp =num;   
////		data_uart1[num] = '\0';
//		DMA1_Channel5->CNDTR=DMA1_BufferSize;       				//重新设置接收数据个数
//			
//		DMA_Cmd(DMA1_Channel5,ENABLE);  										//开启接收DMA
//		DMA_Cmd(DMA1_Channel4,ENABLE);											//DMA发送开启
////#endif
//		}
//			
//	if(USART_GetITStatus(USART2,USART_IT_IDLE) == SET)
//    {
//		USART_ClearITPendingBit(USART2,USART_IT_IDLE); 				//清除空闲串口标志位
//		num = USART2->DR; 																		//读出数据以完成清除标志
//		DMA_Cmd(DMA1_Channel6,DISABLE);    										//关闭接收DMA
//		num = DMA1_BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel6);  	//得到真正接收数据个数
//		DMA1_Channel7->CNDTR =num;														//设定待发送数据个数
//		DMA1_Channel6->CNDTR=DMA1_BufferSize;       				//重新设置接收数据个数
//			
//		DMA_Cmd(DMA1_Channel6,ENABLE);  										//开启接收DMA			
//		DMA_Cmd(DMA1_Channel7,ENABLE);											//DMA发送开启
//		}
/************************************************************************
***********************串口2收发****************************************

if(USART_GetITStatus(USART2,USART_IT_IDLE))
  {
			USART_ClearITPendingBit(USART2,USART_IT_IDLE); 					//清除空闲串口标志位
			num = USART2->DR; 												//读出数据以完成清除标志
			DMA_Cmd(DMA1_Channel6,DISABLE);    										//关闭接收DMA
			num = DMA1_BufferSize -  DMA_GetCurrDataCounter(DMA1_Channel6);	//得到真正接收数据个数
			DMA1_Channel7->CNDTR =num;										//设定待发送数据个数
			DMA1_Channel6->CNDTR=DMA1_BufferSize;       					//重新设置接收数据个数				
			DMA_Cmd(DMA1_Channel6,ENABLE);  								//开启接收DMA			
			DMA_Cmd(DMA1_Channel7,ENABLE);									//DMA发送开启
	}
	else if(DMA_GetFlagStatus(DMA1_FLAG_GL7))
	{
		DMA_ClearFlag(DMA1_FLAG_GL7);
		DMA_Cmd(DMA1_Channel7,DISABLE);									//DMA发送开启
	}
*************************************************************************
************************************************************************/
}




